using System;
using System.Text;
using System.Collections.Generic;
using Demo.Wow.WorldServer.Item;

namespace Demo.Wow.Script.ItemTemplate
{

    public class 破损的短剑 : 魔兽世界物品信息
    {

        protected override void 初始化物品信息()
        {


            // 1.物品基本信息:

            唯一序号 = 0x2040100001;
            类型 = 2;
            子类型 = 7;

            名字[0] = "破损的短剑";
            名字[1] = "破损的短剑";
            名字[2] = "破损的短剑";
            名字[3] = "Worn Shortsword";

            模型编号 = 1542;
            品质 = 1;
            标记 = 0;
            购买数量 = 1;
            买价 = 36;
            卖价 = 7;
            装备位置 = 21;



            // 2.物品装备条件:

            职业 = 0;
            种族 = 0;
            物品等级 = 2;
            装备需求等级 = 1;
            技能需求编号 = 0;
            技能需求等级 = 0;
            法术需求编号 = 0;
            荣誉需求等级 = 0;
            城市需求等级 = 0;
            阵营需求编号 = 0;
            阵营声望需求等级 = 0;



            // 3.护甲以及抗性:

            护甲值 = 0;
            神圣抗性 = 0;
            火焰抗性 = 0;
            自然抗性 = 0;
            冰霜抗性 = 0;
            阴影抗性 = 0;
            奥术抗性 = 0;



            // 4.附加属性:

            附加属性[0] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[1] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[2] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[3] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[4] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[5] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[6] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[7] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[8] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );
            附加属性[9] = new WowItemAddOnProperty( 0/*附加属性类型*/, 0/*附加数值*/ );




            // 5.伤害属性:

            神圣最小伤害 = 1;
            神圣最大伤害 = 3;

            火焰最小伤害 = 0;
            火焰最大伤害 = 0;

            自然最小伤害 = 0;
            自然最大伤害 = 0;

            冰霜最小伤害 = 0;
            冰霜最大伤害 = 0;

            阴影最小伤害 = 0;
            阴影最大伤害 = 0;

            奥术最小伤害 = 0;
            奥术最大伤害 = 0;




            // 6.数量和包的设置:

            可持有最大数量 = 0;
            可堆叠数量 = 1;
            背包格数 = 0;




            // 7.近战与远程属性:

            弹药类型 = 0;
            攻击间隔 = 1900;
            武器类型 = 0;




            // 8.杂项设置(很多未知):

            绑定类型 = 0;
            描述信息 = "这个是一个披风";
            文字编号 = 0;
            语言类型 = 1;
            页面材质 = 0;
            任务编号 = 0;
            锁的编号 = 0;
            材料类型 = 1;
            配戴位置 = 3;
            附属物品 = 0;
            格挡     = 0;
            套装编号 = 0;
            最大耐久度 = 20;
            限定地点 = 0;
            背包类型 = 0;




            // 9.装备绿字效果魔法效果:

            法术[0] = new WowItemSpell( 0/*魔法效果*/, 0/*触发类型*/, 0/*魔法消耗*/, 0/*冷却时间*/, 0/*魔法种类*/, 0/*魔法冷却类型*/ );
            法术[1] = new WowItemSpell( 0, 0, 0, 0, 0, 0 );
            法术[2] = new WowItemSpell( 0, 0, 0, 0, 0, 0 );
            法术[3] = new WowItemSpell( 0, 0, 0, 0, 0, 0 );
            法术[4] = new WowItemSpell( 0, 0, 0, 0, 0, 0 );



        }
    }
}
